openocd-org/openocd/src/flash/nor/stm32h5x.c
// SPDX-License-Identifier: GPL-2.0-or-later

/*
 * Copyright (C) 2022 by Tarek BOCHKATI for STMicroelectronics
 * <tarek.bouchkati@st.com>
 */

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include "imp.h"
#include <helper/binarybuffer.h>
#include <target/algorithm.h>
#include <target/breakpoints.h>
#include <target/cortex_m.h>
#include <target/arm_adi_v5.h>
#include "stm32h5x.h"
#include <target/image.h>

enum stm32h5x_bank_id {
	STM32_BANK1 = 1,
	STM32_BANK2 = 2,
	STM32_ALL_BANKS
};

enum stm32h5x_pstate {
	PSTATE_OPEN				= 0xED,
	PSTATE_PROVISIONING		= 0x17,
	PSTATE_IROT_PROVISIONED	= 0x2E,
	PSTATE_TZ_CLOSED		= 0xC6,
	PSTATE_CLOSED			= 0x72,
	PSTATE_LOCKED			= 0x5C,
	PSTATE_REGRESSION		= 0x9A,
	PSTATE_NS_REGRESSION	= 0xA3
};

static const char *stm32h5x_product_state_str(enum stm32h5x_pstate pstate)
{
	switch (pstate) {
	case PSTATE_OPEN:
		return "Open";
	case PSTATE_PROVISIONING:
		return "Provisioning";
	case PSTATE_IROT_PROVISIONED:
		return "iROT-Provisioned";
	case PSTATE_TZ_CLOSED:
		return "TZ-Closed";
	case PSTATE_CLOSED:
		return "Closed";
	case PSTATE_LOCKED:
		return "Locked";
	case PSTATE_REGRESSION:
		return "Regression";
	case PSTATE_NS_REGRESSION:
		return "NS-Regression";
	}

	return "Unknown";
}

struct rsslib_data_provisioning_conf {
	uint32_t p_source;        /* Address of the Data to be provisioned, shall be in SRAM3 */
	uint32_t p_destination;   /* Address in OBKeys sections where to provision Data */
	uint32_t size;            /* Size in bytes of the Data to be provisioned */
	uint32_t do_encryption;    /* Notifies RSSLIB_DataProvisioning to encrypt or not Data */
	uint32_t crc;             /* CRC over full Data buffer and previous field in the structure */
};

enum stm32h5x_tzen {
	TZEN_DISABLED	= 0xC3,
	TZEN_ENABLED	= 0xB4
};

struct stm32h5x_rev {
	const uint16_t rev;
	const char *name;
};

struct stm32h5x_dev_info {
	uint16_t id;
	const char *name;
	const struct stm32h5x_rev *revs;
	const uint32_t flags; /* one bit per feature, see STM32H5 flags */
	const uint16_t max_flash_size_kb;
	const uint32_t flash_regs_base;
	const uint32_t flash_size_addr;
	const uint32_t wps_group_size; /* write protection group sectors' count */
	const uint32_t wps_mask;
};

struct stm32h5x_flash_bank {
	bool probed;
	uint32_t idcode;
	const struct stm32h5x_dev_info *dev_info;
	unsigned int bank1_sectors, bank1_prot_blocks;
	bool dual_bank;
	uint32_t user_bank_size;
	uint32_t flash_regs_base;
	const uint32_t *flash_regs;
	enum stm32h5x_pstate pstate;
	enum stm32h5x_tzen tzen;
	uint32_t optsr_cur, optsr2_cur; /* options cache to trigger re-probing */
	uint32_t available_rm_addr, rss_lib_addr;
};

/* Human readable list of families this drivers supports (sorted alphabetically) */
static const char *supported_devices_desc = "STM32H5x";

/* Known revisions */
#define NO_MORE_REVS { 0x0, NULL }

static const struct stm32h5x_rev stm32h50xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x1003, "Y" }, NO_MORE_REVS
};

static const struct stm32h5x_rev stm32h56_h57xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x1007, "X" }, NO_MORE_REVS
};

 /* TODO: info still not available, these values are wrong for H5 512 */
static const struct stm32h5x_rev stm32h52_h53xx_revs[] = {
	{ 0x1000, "A" }, { 0x1001, "Z" }, { 0x1007, "X" }, NO_MORE_REVS
};

/* Devices identities */
static const struct stm32h5x_dev_info stm32h5x_dev_info_db[] = {
	{
		.id					= DEVID_STM32H50XX,
		.name				= "STM32H50xx",
		.revs				= stm32h50xx_revs,
		.flags				= F_HAS_DUAL_BANK,
		.max_flash_size_kb	= 128,
		.flash_regs_base	= 0x40022000,
		.flash_size_addr	= 0x08FFF80C,
		.wps_group_size		= 1,
		.wps_mask			= 0xFF,
	},
	{
		.id					= DEVID_STM32H56_H57XX,
		.name				= "STM32H56/H57xx",
		.revs				= stm32h56_h57xx_revs,
		.flags				= F_HAS_DUAL_BANK | F_HAS_TZ,
		.max_flash_size_kb	= 2048,
		.flash_regs_base	= 0x40022000,
		.flash_size_addr	= 0x08FFF80C,
		.wps_group_size		= 4,
		.wps_mask			= 0xFFFFFFFF,
	},
	{
		.id					= DEVID_STM32H52_H53XX,
		.name				= "STM32H52/H53xx",
		.revs				= stm32h52_h53xx_revs,
		.flags				= F_HAS_DUAL_BANK | F_HAS_TZ,
		.max_flash_size_kb	= 512,
		.flash_regs_base	= 0x40022000,
		.flash_size_addr	= 0x08FFF80C,
		.wps_group_size		= 4,
		.wps_mask			= 0xFFFFFFFF,
	},

};

/* Register maps*/
enum stm32h5x_flash_reg_index {
	STM32_FLASH_ACR_INDEX,
	STM32_FLASH_KEYR_INDEX,
	STM32_FLASH_OPTKEYR_INDEX,
	STM32_FLASH_OPTCR_INDEX,
	STM32_FLASH_SR_INDEX,
	STM32_FLASH_CR_INDEX,
	STM32_FLASH_CCR_INDEX,
	STM32_FLASH_OPTSR_CUR_INDEX,
	STM32_FLASH_OPTSR_PRG_INDEX,
	STM32_FLASH_OPTSR2_CUR_INDEX,
	STM32_FLASH_OPTSR2_PRG_INDEX,
	STM32_FLASH_WRP1_CUR_INDEX,
	STM32_FLASH_WRP1_PRG_INDEX,
	STM32_FLASH_WRP2_CUR_INDEX,
	STM32_FLASH_WRP2_PRG_INDEX,
	STM32_FLASH_REG_INDEX_NUM,
};

static const uint32_t stm32h5x_ns_flash_regs[STM32_FLASH_REG_INDEX_NUM] = {
	[STM32_FLASH_ACR_INDEX]			= 0x000,
	[STM32_FLASH_KEYR_INDEX]		= 0x004,
	[STM32_FLASH_OPTKEYR_INDEX]		= 0x00C,
	[STM32_FLASH_OPTCR_INDEX]		= 0x01C,
	[STM32_FLASH_SR_INDEX]			= 0x020,
	[STM32_FLASH_CR_INDEX]			= 0x028,
	[STM32_FLASH_CCR_INDEX]			= 0x030,
	[STM32_FLASH_OPTSR_CUR_INDEX]	= 0x050,
	[STM32_FLASH_OPTSR_PRG_INDEX]	= 0x054,
	[STM32_FLASH_OPTSR2_CUR_INDEX]	= 0x070,
	[STM32_FLASH_OPTSR2_PRG_INDEX]	= 0x074,
	[STM32_FLASH_WRP1_CUR_INDEX]	= 0x0E8,
	[STM32_FLASH_WRP1_PRG_INDEX]	= 0x0EC,
	[STM32_FLASH_WRP2_CUR_INDEX]	= 0x1E8,
	[STM32_FLASH_WRP2_PRG_INDEX]	= 0x1EC,
};

static const uint32_t stm32h5x_s_flash_regs[STM32_FLASH_REG_INDEX_NUM] = {
	[STM32_FLASH_ACR_INDEX]			= 0x000,
	[STM32_FLASH_KEYR_INDEX]		= 0x008,
	[STM32_FLASH_OPTKEYR_INDEX]		= 0x00C,
	[STM32_FLASH_OPTCR_INDEX]		= 0x01C,
	[STM32_FLASH_SR_INDEX]			= 0x024,
	[STM32_FLASH_CR_INDEX]			= 0x02C,
	[STM32_FLASH_CCR_INDEX]			= 0x034,
	[STM32_FLASH_OPTSR_CUR_INDEX]	= 0x050,
	[STM32_FLASH_OPTSR_PRG_INDEX]	= 0x054,
	[STM32_FLASH_OPTSR2_CUR_INDEX]	= 0x070,
	[STM32_FLASH_OPTSR2_PRG_INDEX]	= 0x074,
	[STM32_FLASH_WRP1_CUR_INDEX]	= 0x0E8,
	[STM32_FLASH_WRP1_PRG_INDEX]	= 0x0EC,
	[STM32_FLASH_WRP2_CUR_INDEX]	= 0x1E8,
	[STM32_FLASH_WRP2_PRG_INDEX]	= 0x1EC,
};

uint32_t crc32_func(uint32_t *buff, size_t len)
{
	uint32_t crc = 0xFFFFFFFF;
	const uint32_t poly = 0x04C11DB7U;
	for (size_t i = 0; i < len; i++) {
		crc ^= buff[i];
		for (size_t j = 0; j < 32; j++) {
			if (crc & 0x80000000)
				crc = (crc << 1) ^ poly;
			else
				crc <<= 1;
		}
	}

