openocd-org/openocd/src/flash/nor/stm32h5x.c
	return crc;
}

/* Usage: flash bank stm32h5x <base> <size> 0 0 <target#> */
FLASH_BANK_COMMAND_HANDLER(stm32h5x_flash_bank_command)
{
	struct stm32h5x_flash_bank *stm32h5x_bank;

	if (CMD_ARGC < 6)
		return ERROR_COMMAND_SYNTAX_ERROR;

	/* fix-up bank base address: 0 is used for normal flash memory */
	if (bank->base == 0)
		bank->base = STM32_FLASH_BANK_BASE;

	stm32h5x_bank = calloc(1, sizeof(struct stm32h5x_flash_bank));
	if (!stm32h5x_bank)
		return ERROR_FAIL;

	bank->driver_priv = stm32h5x_bank;

	stm32h5x_bank->probed = false;
	stm32h5x_bank->user_bank_size = bank->size;

	return ERROR_OK;
}

static inline uint32_t stm32h5x_get_flash_reg(struct flash_bank *bank, uint32_t reg_offset)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	return stm32h5x_bank->flash_regs_base + reg_offset;
}

static inline uint32_t stm32h5x_get_flash_reg_by_index(struct flash_bank *bank,
	enum stm32h5x_flash_reg_index reg_index)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	return stm32h5x_get_flash_reg(bank, stm32h5x_bank->flash_regs[reg_index]);
}

static inline int stm32h5x_read_flash_reg(struct flash_bank *bank, uint32_t reg_offset, uint32_t *value)
{
	return target_read_u32(bank->target, stm32h5x_get_flash_reg(bank, reg_offset), value);
}

static inline int stm32h5x_read_flash_reg_by_index(struct flash_bank *bank,
	enum stm32h5x_flash_reg_index reg_index, uint32_t *value)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	return stm32h5x_read_flash_reg(bank, stm32h5x_bank->flash_regs[reg_index], value);
}

static inline int stm32h5x_write_flash_reg(struct flash_bank *bank, uint32_t reg_offset, uint32_t value)
{
	return target_write_u32(bank->target, stm32h5x_get_flash_reg(bank, reg_offset), value);
}

static inline int stm32h5x_write_flash_reg_by_index(struct flash_bank *bank,
	enum stm32h5x_flash_reg_index reg_index, uint32_t value)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	return stm32h5x_write_flash_reg(bank, stm32h5x_bank->flash_regs[reg_index], value);
}

static int stm32h5x_wait_status_flags(struct flash_bank *bank, int timeout, uint32_t flags)
{
	uint32_t status;
	int retval = ERROR_OK;

	/* Wait for busy flags to clear */
	for (;;) {
		retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_SR_INDEX, &status);
		if (retval != ERROR_OK)
			return retval;
		LOG_DEBUG("status: 0x%" PRIx32 "", status);

		if ((status & flags) == 0)
			break;

		if (timeout-- <= 0) {
			LOG_ERROR("timed out waiting for flash");
			return ERROR_FAIL;
		}

		alive_sleep(1);
	}

	if (status & FLASH_WRPERR) {
		LOG_ERROR("stm32x device protected");
		retval = ERROR_FAIL;
	}

	/* Clear but report errors */
	if (status & FLASH_ERROR) {
		if (retval == ERROR_OK)
			retval = ERROR_FAIL;

		/* If this operation fails, we ignore it and report the original retval */
		stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CCR_INDEX, status & FLASH_ERROR);
	}

	return retval;
}

static inline int stm32h5x_wait_status_busy(struct flash_bank *bank, int timeout)
{
	return stm32h5x_wait_status_flags(bank, timeout, FLASH_BSY);
}

static inline int stm32h5x_wait_status_prev_op(struct flash_bank *bank, int timeout)
{
	return stm32h5x_wait_status_flags(bank, timeout, FLASH_BSY | FLASH_WBNE | FLASH_DBNE);
}

static int stm32h5x_unlock_reg(struct flash_bank *bank)
{
	uint32_t cr;

	/* First check if not already unlocked,
	 * otherwise writing on STM32_FLASH_KEYR will fail
	 */
	int retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, &cr);
	if (retval != ERROR_OK)
		return retval;

	if ((cr & FLASH_LOCK) == 0)
		return ERROR_OK;

	/* Unlock flash registers */
	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_KEYR_INDEX, KEY1);
	if (retval != ERROR_OK)
		return retval;

	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_KEYR_INDEX, KEY2);
	if (retval != ERROR_OK)
		return retval;

	retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, &cr);
	if (retval != ERROR_OK)
		return retval;

	if (cr & FLASH_LOCK) {
		LOG_ERROR("flash not unlocked STM32_FLASH_CR: %" PRIx32, cr);
		return ERROR_TARGET_FAILURE;
	}

	return ERROR_OK;
}

static int stm32h5x_unlock_option_reg(struct flash_bank *bank)
{
	uint32_t optcr;

	int retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_OPTCR_INDEX, &optcr);
	if (retval != ERROR_OK)
		return retval;

	if ((optcr & FLASH_OPTLOCK) == 0)
		return ERROR_OK;

	/* Unlock option registers */
	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_OPTKEYR_INDEX, OPTKEY1);
	if (retval != ERROR_OK)
		return retval;

	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_OPTKEYR_INDEX, OPTKEY2);
	if (retval != ERROR_OK)
		return retval;

	retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_OPTCR_INDEX, &optcr);
	if (retval != ERROR_OK)
		return retval;

	if (optcr & FLASH_OPTLOCK) {
		LOG_ERROR("options not unlocked STM32_FLASH_OPTCR: %" PRIx32, optcr);
		return ERROR_TARGET_FAILURE;
	}

	return ERROR_OK;
}

/** set all FLASH_SECBB registers to the same value */
static int stm32h5x_set_secbb(struct flash_bank *bank, uint32_t value)
{
	/* This function should be used only with device with TrustZone, do just a security check */
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	assert(stm32h5x_bank->dev_info->flags & F_HAS_TZ);

	int retval = stm32h5x_wait_status_prev_op(bank, FLASH_TIMEOUT);
	if (retval != ERROR_OK)
		return retval;

	/* write SECBBxRy registers */
	LOG_DEBUG("setting secure block-based areas registers (SECBBxRy) to 0x%08x", value);

	const uint16_t secbb_regs[] = {
			FLASH_SECBB1(1), FLASH_SECBB1(2), FLASH_SECBB1(3), FLASH_SECBB1(4), /* bank 1 SECBB register offsets */
			FLASH_SECBB2(1), FLASH_SECBB2(2), FLASH_SECBB2(3), FLASH_SECBB2(4)  /* bank 2 SECBB register offsets */
	};

	unsigned int num_secbb_regs = ARRAY_SIZE(secbb_regs);

	/* in single bank mode, it's useless to modify FLASH_SECBB2Rx registers
	 * then consider only the first half of secbb_regs
	 */
	if (!stm32h5x_bank->dual_bank)
		num_secbb_regs /= 2;

	for (unsigned int i = 0; i < num_secbb_regs; i++) {
		retval = stm32h5x_write_flash_reg(bank, secbb_regs[i], value);
		if (retval != ERROR_OK)
			return retval;
	}

	return ERROR_OK;
}

static int stm32h5x_write_option(struct flash_bank *bank, uint32_t reg_offset,
	uint32_t value, uint32_t mask)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	uint32_t optiondata;
	int retval, retval2;

