openocd-org/openocd/src/flash/nor/stm32h5x.c
	retval = stm32h5x_read_flash_reg(bank, reg_offset, &optiondata);
	if (retval != ERROR_OK)
		return retval;

	/* for STM32H5 and similar devices, use always non-secure
	 * registers for option bytes programming */
	const uint32_t *saved_flash_regs = stm32h5x_bank->flash_regs;
	if (stm32h5x_bank->dev_info->flags & F_HAS_TZ)
		stm32h5x_bank->flash_regs = stm32h5x_ns_flash_regs;

	retval = stm32h5x_wait_status_prev_op(bank, FLASH_TIMEOUT);

	retval = stm32h5x_unlock_option_reg(bank);
	if (retval != ERROR_OK)
		goto err_lock;

	optiondata = (optiondata & ~mask) | (value & mask);

	retval = stm32h5x_write_flash_reg(bank, reg_offset, optiondata);
	if (retval != ERROR_OK)
		goto err_lock;

	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_OPTCR_INDEX, FLASH_OPTSTRT);
	if (retval != ERROR_OK)
		goto err_lock;

	retval = stm32h5x_wait_status_busy(bank, FLASH_TIMEOUT);

err_lock:
	retval2 = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_OPTCR_INDEX, FLASH_OPTLOCK);
	stm32h5x_bank->flash_regs = saved_flash_regs;

	if (retval != ERROR_OK)
		return retval;

	return retval2;
}

static int stm32h5x_erase(struct flash_bank *bank, unsigned int first,
		unsigned int last)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	int retval, retval2;

	assert((first <= last) && (last < bank->num_sectors));

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* set all FLASH pages as secure */
		retval = stm32h5x_set_secbb(bank, FLASH_SECBB_SECURE);
		if (retval != ERROR_OK) {
			/* restore all FLASH pages as non-secure */
			stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE); /* ignore the return value */
			return retval;
		}
	}

	/* Standard Flash sector erase sequence
	 * 1. Make sure protection mechanism does not prevent sector erase
	 *    (WRP, secure flag, HDP) [this step is ignored]
	 * 2. Check there is no ongoing FLASH operation by checking BSY and DBNE in FLASH_NSSR,
	 *    and that the write buffer is empty by checking the WBNE in the FLASH_NSSR
	 * 3. Check and clear all previous non-secure error flags
	 * 4. Unlock the FLASH_NSCR register
	 * 5. Set BKSEL, SER and SNB in FLASH_NSCR
	 * 6. Set STRT in FLASH_NSCR
	 * 7. Wait for BSY to be cleared in the FLASH_NSSR
	 * 8. STRT is automatically cleared
	 * 9. Clear SER in FLASH_NSCR after all sector erase request are issued
	 */

	/* Step 2 & 3 */
	retval = stm32h5x_wait_status_prev_op(bank, FLASH_TIMEOUT);
	if (retval != ERROR_OK)
		return retval;

	/* Step 4 */
	retval = stm32h5x_unlock_reg(bank);
	if (retval != ERROR_OK)
		goto err_lock;

	/* Step 5, 6 and 7 in a loop */
	for (unsigned int i = first; i <= last; i++) {
		uint32_t erase_flags = FLASH_SER | FLASH_STRT;

		if (i >= stm32h5x_bank->bank1_sectors) {
			uint8_t snb;
			snb = i - stm32h5x_bank->bank1_sectors;
			erase_flags |= snb << FLASH_SNB_POS | FLASH_BKSEL;
		} else {
			erase_flags |= i << FLASH_SNB_POS;
		}

		retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, erase_flags);
		if (retval != ERROR_OK)
			break;

		retval = stm32h5x_wait_status_busy(bank, FLASH_ERASE_TIMEOUT);
		if (retval != ERROR_OK)
			break;
	}

err_lock:
	/* this implicitly clears SER (Step 9) */
	retval2 = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, FLASH_LOCK);

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* restore all FLASH pages as non-secure */
		int retval3 = stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE);
		if (retval3 != ERROR_OK)
			return retval3;
	}

	if (retval != ERROR_OK)
		return retval;

	return retval2;
}

static int stm32h5x_mass_erase(struct flash_bank *bank, enum stm32h5x_bank_id bank_id)
{
	/* FIXME mass erase not working */
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	int retval, retval2;

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* set all FLASH pages as secure */
		retval = stm32h5x_set_secbb(bank, FLASH_SECBB_SECURE);
		if (retval != ERROR_OK) {
			/* restore all FLASH pages as non-secure */
			stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE); /* ignore the return value */
			return retval;
		}
	}

	/* Flash mass erase sequence
	 * 1. Make sure protection mechanism does not prevent mass erase
	 *    (WRP, secure flag, HDP) [this step is ignored]
	 * 2. Check there is no ongoing FLASH operation by checking BSY and DBNE in FLASH_NSSR,
	 *    and that the write buffer is empty by checking the WBNE in the FLASH_NSSR
	 * 3. Check and clear all previous non-secure error flags
	 * 4. Unlock the FLASH_NSCR
	 * 5. Set MER in FLASH_NSCR
	 * 6. Set STRT in FLASH_NSCR
	 * 7. Wait for the BSY to be cleared in the FLASH_NSSR
	 * 8. STRT is automatically cleared
	 * 9. Clear MER in FLASH_NSCR
	 */

	/* Bank erase sequence, same as above with this change
	 * 5. Set BER and select the bank using BKSEL in FLASH_NSCR
	 * 9. Clear BER and BKSEL
	 */

	uint32_t flash_cr_op;

	switch (bank_id) {
	case STM32_BANK1:
		flash_cr_op = FLASH_BER | FLASH_STRT;
		break;
	case STM32_BANK2:
		flash_cr_op = FLASH_BER | FLASH_BKSEL | FLASH_STRT;
		break;
	case STM32_ALL_BANKS:
		flash_cr_op = FLASH_MER | FLASH_STRT;
		break;
	default:
		LOG_ERROR("incorrect bank_id");
		return ERROR_OK;
	}

	/* Step 2 & 3 */
	retval = stm32h5x_wait_status_prev_op(bank, FLASH_TIMEOUT);
	if (retval != ERROR_OK)
		return retval;

	/* Step 4 */
	retval = stm32h5x_unlock_reg(bank);
	if (retval != ERROR_OK)
		goto err_lock;

	/* Step 5, 6 and 7 in a loop */

	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, flash_cr_op);
	if (retval != ERROR_OK)
		goto err_lock;

	retval = stm32h5x_wait_status_busy(bank, FLASH_ERASE_TIMEOUT);

err_lock:
	/* this implicitly clears MER/BER/BKSEL (Step 9) */
	retval2 = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, FLASH_LOCK);

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* restore all FLASH pages as non-secure */
		int retval3 = stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE);
		if (retval3 != ERROR_OK)
			return retval3;
	}

