openocd-org/openocd/src/flash/nor/stm32h5x.c
	if (retval != ERROR_OK)
		return retval;

	return retval2;
}

static int stm32h5x_protect_inner(struct flash_bank *bank, int set,
		enum stm32h5x_bank_id bank_id, unsigned int first, unsigned int last)
{
	assert(bank_id != STM32_ALL_BANKS);

	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;

	if (bank_id == STM32_BANK2 && !stm32h5x_bank->dual_bank) {
		LOG_ERROR("this device have a single bank");
		return ERROR_FAIL;
	}

	enum stm32h5x_flash_reg_index wrp_cur_idx = STM32_FLASH_WRP1_CUR_INDEX;
	enum stm32h5x_flash_reg_index wrp_prg_idx = STM32_FLASH_WRP1_PRG_INDEX;

	if (bank_id == STM32_BANK2) {
		wrp_cur_idx = STM32_FLASH_WRP2_CUR_INDEX;
		wrp_prg_idx = STM32_FLASH_WRP2_PRG_INDEX;
		first -= stm32h5x_bank->bank1_prot_blocks;
		last -= stm32h5x_bank->bank1_prot_blocks;
	}

	uint32_t protection;

	/* Read 'write protection' settings */
	int retval = stm32h5x_read_flash_reg_by_index(bank, wrp_cur_idx, &protection);
	if (retval != ERROR_OK) {
		LOG_DEBUG("unable to read BANK %d WRP_CUR register", bank_id);
		return retval;
	}

	for (unsigned int i = first; i <= last; i++) {
		if (set)
			protection &= ~(1 << i);
		else
			protection |= (1 << i);
	}

	/* Apply new option value */
	return stm32h5x_write_option(bank, stm32h5x_bank->flash_regs[wrp_prg_idx],
			protection, stm32h5x_bank->dev_info->wps_mask);
}

static int stm32h5x_protect(struct flash_bank *bank, int set, unsigned int first, unsigned int last)
{
	struct target *target = bank->target;
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	/* The requested block for protection could be spread between the 2 banks */
	if (last < stm32h5x_bank->bank1_prot_blocks)
		return stm32h5x_protect_inner(bank, set, STM32_BANK1, first, last);
	else if (first >= stm32h5x_bank->bank1_prot_blocks)
		return stm32h5x_protect_inner(bank, set, STM32_BANK2, first, last);

	int retval = stm32h5x_protect_inner(bank, set, STM32_BANK1,
			first, stm32h5x_bank->bank1_prot_blocks - 1);
	if (retval != ERROR_OK)
		return retval;

	return stm32h5x_protect_inner(bank, set, STM32_BANK1,
			stm32h5x_bank->bank1_prot_blocks, last);
}

static int stm32h5x_protect_check(struct flash_bank *bank)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	uint32_t wrp1;

	/* Read bank 1 'write protection' settings */
	int retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_WRP1_CUR_INDEX, &wrp1);
	if (retval != ERROR_OK) {
		LOG_ERROR("unable to read WRP1_CUR register");
		return retval;
	}

	for (unsigned int i = 0; i < stm32h5x_bank->bank1_prot_blocks; i++)
		bank->prot_blocks[i].is_protected = wrp1 & (1 << i) ? 0 : 1;

	if (!stm32h5x_bank->dual_bank)
		return ERROR_OK;

	/* Read bank 2 'write protection' settings */
	uint32_t wrp2;
	retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_WRP2_CUR_INDEX, &wrp2);
	if (retval != ERROR_OK) {
		LOG_ERROR("unable to read WRP2_CUR register");
		return retval;
	}

	const unsigned int bank2_prot_blocks = bank->num_prot_blocks - stm32h5x_bank->bank1_prot_blocks;

	for (unsigned int i = 0; i < bank2_prot_blocks; i++)
		bank->prot_blocks[i + stm32h5x_bank->bank1_prot_blocks].is_protected = wrp2 & (1 << i) ? 0 : 1;

	return ERROR_OK;
}

/* count is the size divided by FLASH_DATA_WIDTH */
static int stm32h5x_write_block_fast(struct flash_bank *bank, const uint8_t *buffer,
	uint32_t offset, uint32_t count)
{
	struct target *target = bank->target;
	struct working_area *write_algorithm;
	struct working_area *source;
	uint32_t address = bank->base + offset;
	struct reg_param reg_params[5];
	struct armv7m_algorithm armv7m_info;
	int retval = ERROR_OK;

	static const uint8_t stm32h5x_flash_write_code[] = {
#include "../../../contrib/loaders/flash/stm32/stm32h5x.inc"
	};

	if (target_alloc_working_area(target, sizeof(stm32h5x_flash_write_code),
			&write_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do block memory writes");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	retval = target_write_buffer(target, write_algorithm->address,
			sizeof(stm32h5x_flash_write_code),
			stm32h5x_flash_write_code);
	if (retval != ERROR_OK) {
		target_free_working_area(target, write_algorithm);
		return retval;
	}

	/* data_width should be multiple of double-word */
	assert(FLASH_DATA_WIDTH % 8 == 0);
	const size_t extra_size = sizeof(struct stm32h5x_work_area);
	uint32_t buffer_size = target_get_working_area_avail(target) - extra_size;
	/* buffer_size should be multiple of stm32h5_info->data_width */
	buffer_size &= ~(FLASH_DATA_WIDTH - 1);

	if (buffer_size < 256) {
		LOG_WARNING("large enough working area not available, can't do block memory writes");
		target_free_working_area(target, write_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	} else if (buffer_size > 16384) {
		/* probably won't benefit from more than 16k ... */
		buffer_size = 16384;
	}

	if (target_alloc_working_area_try(target, buffer_size + extra_size, &source) != ERROR_OK) {
		LOG_ERROR("allocating working area failed");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	armv7m_info.common_magic = ARMV7M_COMMON_MAGIC;
	armv7m_info.core_mode = ARM_MODE_THREAD;

	/* contrib/loaders/flash/stm32/stm32h5x.c:write() arguments */
	init_reg_param(&reg_params[0], "r0", 32, PARAM_IN_OUT);	/* stm32h5_work_area ptr , status (out) */
	init_reg_param(&reg_params[1], "r1", 32, PARAM_OUT);	/* buffer end */
	init_reg_param(&reg_params[2], "r2", 32, PARAM_OUT);	/* target address */
	init_reg_param(&reg_params[3], "r3", 32, PARAM_OUT);	/* count (of stm32h5_info->data_width) */

	buf_set_u32(reg_params[0].value, 0, 32, source->address);
	buf_set_u32(reg_params[1].value, 0, 32, source->address + source->size);
	buf_set_u32(reg_params[2].value, 0, 32, address);
	buf_set_u32(reg_params[3].value, 0, 32, count);

	/* write algo stack pointer */
	init_reg_param(&reg_params[4], "sp", 32, PARAM_OUT);
	buf_set_u32(reg_params[4].value, 0, 32, source->address +
			offsetof(struct stm32h5x_work_area, stack) + LDR_STACK_SIZE);

	struct stm32h5x_loader_params loader_extra_params;

