openocd-org/openocd/src/flash/nor/stm32h5x.c
	target_buffer_set_u32(target, (uint8_t *)&loader_extra_params.flash_sr_addr,
			stm32h5x_get_flash_reg_by_index(bank, STM32_FLASH_SR_INDEX));
	target_buffer_set_u32(target, (uint8_t *)&loader_extra_params.flash_cr_addr,
			stm32h5x_get_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX));
	target_buffer_set_u32(target, (uint8_t *)&loader_extra_params.flash_word_size,
			FLASH_DATA_WIDTH);

	retval = target_write_buffer(target, source->address, sizeof(loader_extra_params),
			(uint8_t *)&loader_extra_params);
	if (retval != ERROR_OK)
		return retval;

	retval = target_run_flash_async_algorithm(target, buffer, count, FLASH_DATA_WIDTH,
			0, NULL,
			ARRAY_SIZE(reg_params), reg_params,
			source->address + offsetof(struct stm32h5x_work_area, fifo),
			source->size - offsetof(struct stm32h5x_work_area, fifo),
			write_algorithm->address, 0,
			&armv7m_info);

	if (retval == ERROR_FLASH_OPERATION_FAILED) {
		LOG_ERROR("error executing stm32l4 flash write algorithm");

		uint32_t error;
		stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_SR_INDEX, &error);
		error &= FLASH_ERROR;

		if (error & FLASH_WRPERR)
			LOG_ERROR("flash memory write protected");

		if (error != 0) {
			LOG_ERROR("flash write failed = %08" PRIx32, error);
			/* Clear but report errors */
			stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_SR_INDEX, error);
			retval = ERROR_FAIL;
		}
	}

	target_free_working_area(target, source);
	target_free_working_area(target, write_algorithm);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);

	return retval;
}

/* count is the size divided by FLASH_DATA_WIDTH */
static int stm32h5x_write_block_slow(struct flash_bank *bank, const uint8_t *buffer,
				uint32_t offset, uint32_t count)
{
	struct target *target = bank->target;
	uint32_t address = bank->base + offset;
	int retval = ERROR_OK;

	/* The recommended single-write sequence
	 * 1. Make sure protection mechanism does not prevent sector erase
	 *    (WRP, secure flag, HDP) [this step is ignored]
	 * 2. Check there is no ongoing FLASH operation by checking BSY and DBNE in FLASH_NSSR,
	 *    and that the write buffer is empty by checking the WBNE in the FLASH_NSSR
	 * 3. Check and clear all previous non-secure error flags
	 * 4. Unlock the FLASH_NSCR register
	 * 5. Enable write operations by setting PG FLASH_NSCR
	 * 6. Write one Flash-word at aligned address
	 * 7. Wait for BSY to be cleared in the FLASH_NSSR
	 * 8. Clear PG
	 */

	/* Step 2 & 3 */
	retval = stm32h5x_wait_status_prev_op(bank, FLASH_TIMEOUT);
	if (retval != ERROR_OK)
		return retval;

	/* Step 4, done in the caller function 'stm32h5x_write()' */

	/* set PG in FLASH_CR */
	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, FLASH_PG);
	if (retval != ERROR_OK)
		return retval;

	/* write directly to flash memory */
	const uint8_t *src = buffer;
	const uint32_t data_width_in_words = FLASH_DATA_WIDTH / 4;
	while (count--) {
		retval = target_write_memory(target, address, 4, data_width_in_words, src);
		if (retval != ERROR_OK)
			return retval;

		/* wait for BSY bit */
		retval = stm32h5x_wait_status_busy(bank, FLASH_WRITE_TIMEOUT);
		if (retval != ERROR_OK)
			return retval;

		keep_alive();
		src += FLASH_DATA_WIDTH;
		address += FLASH_DATA_WIDTH;
	}

	/* reset PG in FLASH_CR */
	retval = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, 0);
	if (retval != ERROR_OK)
		return retval;

	return retval;
}

static int stm32h5x_write(struct flash_bank *bank, const uint8_t *buffer,
	uint32_t offset, uint32_t count)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	int retval = ERROR_OK, retval2;

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* set all FLASH pages as secure */
		retval = stm32h5x_set_secbb(bank, FLASH_SECBB_SECURE);
		if (retval != ERROR_OK) {
			/* restore all FLASH pages as non-secure */
			stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE); /* ignore the return value */
			return retval;
		}
	}

	/* The flash write must be aligned to the 'FLASH_DATA_WIDTH' boundary.
	 * The flash infrastructure ensures it, do just a security check */
	assert(offset % FLASH_DATA_WIDTH == 0);
	assert(count % FLASH_DATA_WIDTH == 0);

	if (retval != ERROR_OK)
		return retval;

	retval = stm32h5x_unlock_reg(bank);
	if (retval != ERROR_OK)
		goto err_lock;

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate != PSTATE_OPEN) {
		LOG_INFO("TZ On and PState not OPEN: programming without flash loader (slower)");
		retval = stm32h5x_write_block_slow(bank, buffer, offset, count / FLASH_DATA_WIDTH);
	} else {
		/* write using the loader, for better performance */
		retval = stm32h5x_write_block_fast(bank, buffer, offset, count / FLASH_DATA_WIDTH);

		/* if resources are not available write without a loader */
		if (retval == ERROR_TARGET_RESOURCE_NOT_AVAILABLE) {
			LOG_WARNING("falling back to programming without a flash loader (slower)");
			retval = stm32h5x_write_block_slow(bank, buffer, offset,
					count / FLASH_DATA_WIDTH);
		}
	}

err_lock:
	retval2 = stm32h5x_write_flash_reg_by_index(bank, STM32_FLASH_CR_INDEX, FLASH_LOCK);

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* restore all FLASH pages as non-secure */
		int retval3 = stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE);
		if (retval3 != ERROR_OK)
			return retval3;
	}

	if (retval != ERROR_OK) {
		LOG_ERROR("block write failed");
		return retval;
	}
	return retval2;
}

int stm32h5x_read(struct flash_bank *bank,
	uint8_t *buffer, uint32_t offset, uint32_t count)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	int retval;

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* set all FLASH pages as secure */
		retval = stm32h5x_set_secbb(bank, FLASH_SECBB_SECURE);
		if (retval != ERROR_OK) {
			/* restore all FLASH pages as non-secure */
			stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE); /* ignore the return value */
			return retval;
		}
	}

