openocd-org/openocd/src/flash/nor/stm32h5x.c
	int retval2 = target_read_buffer(bank->target, offset + bank->base, count, buffer);

	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		/* restore all FLASH pages as non-secure */
		retval = stm32h5x_set_secbb(bank, FLASH_SECBB_NON_SECURE);
		if (retval != ERROR_OK)
			return retval;
	}

	return retval2;
}

static int stm32h5x_read_idcode(struct flash_bank *bank, uint32_t *id)
{
	int retval = ERROR_OK;
	struct target *target = bank->target;

	/* read stm32 device id register */
	retval = target_read_u32(target, DBGMCU_IDCODE, id);

	if (retval != ERROR_OK) {
		LOG_ERROR("can't get the device id");
	}

	return retval;
}

static const char *get_stm32h5x_device_str(struct flash_bank *bank)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	return stm32h5x_bank->dev_info->name;
}

static const char *get_stm32h5x_rev_str(struct flash_bank *bank)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	const struct stm32h5x_rev *revs = stm32h5x_bank->dev_info->revs;

	const uint16_t rev_id = stm32h5x_bank->idcode >> 16;

	for (unsigned int i = 0; revs[i].rev != 0; i++) {
		if (rev_id == revs[i].rev)
			return revs[i].name;
	}

	return "'unknown'";
}

static const char *get_stm32h5x_bank_type_str(struct flash_bank *bank)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	return stm32h5x_bank->dual_bank ? "dual" : "single";
}

static void stm32h5x_sync_product_state(struct flash_bank *bank)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;

	stm32h5x_bank->tzen = TZEN_DISABLED;
	if (stm32h5x_bank->dev_info->flags & F_HAS_TZ)
		stm32h5x_bank->tzen = (stm32h5x_bank->optsr2_cur >> FLASH_TZEN_POS) & FLASH_TZEN_MASK;

	stm32h5x_bank->pstate = (stm32h5x_bank->optsr_cur >> FLASH_PSTATE_POS) & FLASH_PSTATE_MASK;
}

static int stm32h5x_probe(struct flash_bank *bank)
{
	struct target *target = bank->target;
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;

	stm32h5x_bank->probed = false;

	/* Read stm32 device id registers */
	int retval = stm32h5x_read_idcode(bank, &stm32h5x_bank->idcode);
	if (retval != ERROR_OK)
		return retval;

	const uint32_t device_id = stm32h5x_bank->idcode & 0xFFF;

	for (unsigned int n = 0; n < ARRAY_SIZE(stm32h5x_dev_info_db); n++) {
		if (device_id == stm32h5x_dev_info_db[n].id) {
			stm32h5x_bank->dev_info = &stm32h5x_dev_info_db[n];
			break;
		}
	}

	if (!stm32h5x_bank->dev_info) {
		LOG_WARNING("Cannot identify target as an %s family device.",
				supported_devices_desc);

		return ERROR_FAIL;
	}

	const struct stm32h5x_dev_info *dev_info = stm32h5x_bank->dev_info;
	const char *device_str = get_stm32h5x_device_str(bank);
	const char *rev_str = get_stm32h5x_rev_str(bank);
	const uint16_t rev_id = stm32h5x_bank->idcode >> 16;

	LOG_INFO("device idcode = 0x%08" PRIx32 " (%s - Rev %s : 0x%04x)",
			stm32h5x_bank->idcode, device_str, rev_str, rev_id);

	stm32h5x_bank->flash_regs_base = dev_info->flash_regs_base;
	/* Set flash write alignment boundaries.
	 * Ask the flash infrastructure to ensure required alignment */
	bank->write_start_alignment = FLASH_DATA_WIDTH;
	bank->write_end_alignment = FLASH_DATA_WIDTH;

	/* Initialize the flash register map */
	stm32h5x_bank->flash_regs = stm32h5x_ns_flash_regs;

	/* Read flash option register */
	retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_OPTSR_CUR_INDEX,
			&stm32h5x_bank->optsr_cur);
	if (retval != ERROR_OK)
		return retval;

	retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_OPTSR2_CUR_INDEX,
			&stm32h5x_bank->optsr2_cur);
	if (retval != ERROR_OK)
		return retval;

	stm32h5x_sync_product_state(bank);

	/* For devices with TrustZone enabled and Product State 'Open', use flash secure registers */
	if (stm32h5x_bank->tzen == TZEN_ENABLED && stm32h5x_bank->pstate == PSTATE_OPEN) {
		stm32h5x_bank->flash_regs_base |= STM32_REGS_SEC_OFFSET;
		stm32h5x_bank->flash_regs = stm32h5x_s_flash_regs;
	}

	if (dev_info->flags & F_HAS_TZ)
		LOG_INFO("TZEN = 0x%02X : TrustZone %s by option bytes",
				stm32h5x_bank->tzen,
				stm32h5x_bank->tzen == TZEN_ENABLED ? "enabled" : "disabled");

	LOG_INFO("Product State = 0x%02X : '%s'",
			stm32h5x_bank->pstate, stm32h5x_product_state_str(stm32h5x_bank->pstate));

	if (bank->base != STM32_FLASH_BANK_BASE && bank->base != STM32_FLASH_S_BANK_BASE) {
		LOG_ERROR("invalid bank base address");
		return ERROR_FAIL;
	}

	/* Get flash size from target. */
	uint16_t flash_size_kb = 0xffff;
	retval = target_read_u16(target, dev_info->flash_size_addr, &flash_size_kb);

	/* If failed reading flash size or flash size invalid (early silicon),
	 * default to max target family */
	if (retval != ERROR_OK || flash_size_kb == 0xffff || flash_size_kb == 0
			|| flash_size_kb > dev_info->max_flash_size_kb) {
		LOG_WARNING("STM32 flash size failed, probe inaccurate - assuming %dk flash",
				dev_info->max_flash_size_kb);
		flash_size_kb = dev_info->max_flash_size_kb;
	}

	/* If the user sets the size manually then ignore the probed value,
	 * this allows us to work around devices that have a invalid flash size value */
	if (stm32h5x_bank->user_bank_size) {
		LOG_WARNING("overriding size register by configured bank size - MAY CAUSE TROUBLE");
		flash_size_kb = stm32h5x_bank->user_bank_size / 1024;
	}

	LOG_INFO("flash size = %dkbytes", flash_size_kb);

	/* Did we assign a flash size? */
	assert((flash_size_kb != 0xffff) && flash_size_kb);


	stm32h5x_bank->dual_bank = false;
	stm32h5x_bank->bank1_sectors = 0;
	int num_sectors = 0;
	int sector_size_kb = 0;

	switch (device_id) {
	case DEVID_STM32H50XX:
	case DEVID_STM32H52_H53XX:
	case DEVID_STM32H56_H57XX:
		/* Always dual-bank */
		stm32h5x_bank->dual_bank = true;
		sector_size_kb = 8;
		num_sectors = flash_size_kb / sector_size_kb;
		stm32h5x_bank->bank1_sectors = num_sectors / 2;
		break;
	default:
		LOG_ERROR("unsupported device");
		return ERROR_FAIL;
	}

	LOG_INFO("flash mode : %s-bank", get_stm32h5x_bank_type_str(bank));

	/* Initialize flash infrastructure */
	free(bank->sectors);
	bank->size = flash_size_kb * 1024;
	bank->num_sectors = num_sectors;
	bank->sectors = alloc_block_array(0, sector_size_kb * 1024, bank->num_sectors);

	if (!bank->sectors) {
		LOG_ERROR("failed to allocate bank sectors");
		return ERROR_FAIL;
	}

	/* setup protection blocks */
	stm32h5x_bank->bank1_prot_blocks = stm32h5x_bank->bank1_sectors;
	const uint32_t wpsn = dev_info->wps_group_size;
	assert(bank->num_sectors % wpsn == 0);

	bank->num_prot_blocks = bank->num_sectors / wpsn;
	assert(bank->num_prot_blocks > 0);

	stm32h5x_bank->bank1_prot_blocks = bank->num_prot_blocks / 2;

	free(bank->prot_blocks);

	bank->prot_blocks = alloc_block_array(0, sector_size_kb * wpsn * 1024,
			bank->num_prot_blocks);

	if (!bank->prot_blocks) {
		LOG_ERROR("failed to allocate bank prot_blocks");
		return ERROR_FAIL;
	}

	stm32h5x_bank->probed = true;
	return ERROR_OK;
}

