openocd-org/openocd/src/flash/nor/stm32h5x.c
static int stm32h5x_auto_probe(struct flash_bank *bank)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	if (stm32h5x_bank->probed) {
		uint32_t optsr_cur, optsr2_cur;

		/* Read flash option register and re-probe if optsr value is changed */
		int retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_OPTSR_CUR_INDEX, &optsr_cur);
		if (retval != ERROR_OK)
			return retval;

		if (stm32h5x_bank->optsr_cur == optsr_cur)
			return ERROR_OK;

		/* Read flash option register and re-probe if optsr2 value is changed */
		retval = stm32h5x_read_flash_reg_by_index(bank, STM32_FLASH_OPTSR2_CUR_INDEX, &optsr2_cur);
		if (retval != ERROR_OK)
			return retval;

		if (stm32h5x_bank->optsr_cur == optsr_cur && stm32h5x_bank->optsr2_cur == optsr2_cur)
			return ERROR_OK;
	}

	return stm32h5x_probe(bank);
}

static int get_stm32h5x_info(struct flash_bank *bank, struct command_invocation *cmd)
{
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	const struct stm32h5x_dev_info *dev_info = stm32h5x_bank->dev_info;

	if (dev_info) {
		const uint16_t rev_id = stm32h5x_bank->idcode >> 16;
		command_print_sameline(cmd, "%s - Rev %s : 0x%04x", get_stm32h5x_device_str(bank),
				get_stm32h5x_rev_str(bank), rev_id);
		if (stm32h5x_bank->probed)
			command_print_sameline(cmd, " - Flash %s-bank", get_stm32h5x_bank_type_str(bank));
	} else {
		command_print_sameline(cmd, "Cannot identify target as an %s device", supported_devices_desc);
	}

	return ERROR_OK;
}

COMMAND_HANDLER(stm32h5x_handle_mass_erase_command)
{
	if (CMD_ARGC < 1)
		return ERROR_COMMAND_SYNTAX_ERROR;

	struct flash_bank *bank;
	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (retval != ERROR_OK)
		return retval;

	retval = stm32h5x_mass_erase(bank, STM32_ALL_BANKS);
	if (retval == ERROR_OK)
		command_print(CMD, "mass erase complete");
	else
		command_print(CMD, "mass erase failed");

	return retval;
}

COMMAND_HANDLER(stm32h5x_handle_option_read_command)
{
	if (CMD_ARGC < 2)
		return ERROR_COMMAND_SYNTAX_ERROR;

	struct flash_bank *bank;
	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (retval != ERROR_OK)
		return retval;

	uint32_t reg_offset, reg_addr;
	uint32_t value = 0;

	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[1], reg_offset);
	reg_addr = stm32h5x_get_flash_reg(bank, reg_offset);

	retval = stm32h5x_read_flash_reg(bank, reg_offset, &value);
	if (retval != ERROR_OK)
		return retval;

	command_print(CMD, "Option Register: <0x%" PRIx32 "> = 0x%" PRIx32 "", reg_addr, value);

	return retval;
}

COMMAND_HANDLER(stm32h5x_handle_option_write_command)
{
	if (CMD_ARGC < 3)
		return ERROR_COMMAND_SYNTAX_ERROR;

	struct flash_bank *bank;
	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (retval != ERROR_OK)
		return retval;

	uint32_t reg_offset;
	uint32_t value = 0;
	uint32_t mask = 0xFFFFFFFF;

	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[1], reg_offset);
	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[2], value);

	if (CMD_ARGC > 3)
		COMMAND_PARSE_NUMBER(u32, CMD_ARGV[3], mask);

	command_print(CMD, "%s Option written.\n"
				"INFO: a reset or power cycle is required "
				"for the new settings to take effect.", bank->driver->name);

	retval = stm32h5x_write_option(bank, reg_offset, value, mask);
	return retval;
}

COMMAND_HANDLER(stm32h5x_handle_trustzone_command)
{
	/* TODO */
	return ERROR_FLASH_OPER_UNSUPPORTED;
}

COMMAND_HANDLER(stm32h5x_handle_option_load_command)
{
	/* TODO */
	return ERROR_FLASH_OPER_UNSUPPORTED;
}

COMMAND_HANDLER(stm32h5x_write_obk)
{
	struct flash_bank *bank;
	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (retval != ERROR_OK)
		return retval;
	struct target *target = bank->target;
	struct armv7m_algorithm armv7m_info = {
		.common_magic = ARMV7M_COMMON_MAGIC,
		.core_mode = ARM_MODE_THREAD
	};
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;
	if (CMD_ARGC < 2)
		return ERROR_COMMAND_SYNTAX_ERROR;

	/* open file in binary mode */
	FILE *fp = fopen(CMD_ARGV[1], "rb");
	if (!fp) {
		LOG_ERROR("Error opening file\n");
		return ERROR_FAIL;
	}

	/* read 12 bytes from file into buffer */
	uint32_t buffer[3];
	if (fread(buffer, sizeof(uint32_t), 3, fp) != 3) {
		LOG_ERROR("Error Reading Cert info");
		return ERROR_FAIL;
	}

	if (!stm32h5x_bank->available_rm_addr) {
		LOG_ERROR("You should enter an available ram addr using write_obk_options command");
		return ERROR_FAIL;
	}

	if (!stm32h5x_bank->rss_lib_addr) {
		LOG_ERROR("You should enter the addr of Rss_lib_privisioning function using write_obk_options command");
		return ERROR_FAIL;
	}

	struct rsslib_data_provisioning_conf pconf = {
		.p_source = stm32h5x_bank->available_rm_addr + 0x18,
		.p_destination = buffer[0],	/* extract the first 32 bits into pDestination (OBK area) */
		.size = buffer[1], /* extract the second 32 bits into Size (Size of data to be provisioned) */
		.do_encryption = buffer[2] == 1 ? 0xF5F5A0AA : 0xCACA0AA0, /* extract the third 32 bits
		(1 : do encryption else do not encrypt data) */
		.crc = 0  /* will be computed later */
	};

	uint8_t *data = malloc(pconf.size);
	if (fread(data, sizeof(uint32_t), pconf.size / 4, fp) != pconf.size / 4) {
		LOG_ERROR("Can't read certfication data");
		free(data);
		return ERROR_FAIL;
	}
	fclose(fp); /* close the file */

	/* reorganize the certification to calculate the CRC */
	uint8_t *crc_buffer = malloc(12 + pconf.size);
	memcpy(crc_buffer, data, pconf.size);
	memcpy(crc_buffer + pconf.size, &pconf.p_destination, 4);
	memcpy(crc_buffer + pconf.size + 4, &pconf.size, 4);
	memcpy(crc_buffer + pconf.size + 8, &pconf.do_encryption, 4);
	uint32_t crc_buffer32[(12 + pconf.size) / 4];
	memcpy(crc_buffer32, crc_buffer, (12 + pconf.size));
	pconf.crc = crc32_func(crc_buffer32, (12 + pconf.size) / 4);

	retval = target_write_buffer(target, pconf.p_source, pconf.size, data);
	if (retval != ERROR_OK) {
		LOG_ERROR("Can't write certification data in RAM");
		free(data);
		free(crc_buffer);
		return retval;
	}

	const uint32_t return_addr = stm32h5x_bank->available_rm_addr;
	target_write_u32(target, stm32h5x_bank->available_rm_addr + 0x4, stm32h5x_bank->available_rm_addr + 0x18);
	target_write_u32(target, stm32h5x_bank->available_rm_addr + 0x8, pconf.p_destination);
	target_write_u32(target, stm32h5x_bank->available_rm_addr + 0xC, pconf.size);
	target_write_u32(target, stm32h5x_bank->available_rm_addr + 0x10, pconf.do_encryption);
	target_write_u32(target, stm32h5x_bank->available_rm_addr + 0x14, pconf.crc);

	/* write function parameters */
	struct reg_param reg_params[3];
	init_reg_param(&reg_params[0], "r0", 32, PARAM_IN_OUT);
	init_reg_param(&reg_params[1], "r1", 32, PARAM_OUT);
	init_reg_param(&reg_params[2], "lr", 32, PARAM_OUT);
	buf_set_u32(reg_params[2].value, 0, 32, return_addr | 0x1);

	buf_set_u32(reg_params[0].value, 0, 32, stm32h5x_bank->available_rm_addr + 0x4);

	breakpoint_add(target, return_addr, 2, BKPT_SOFT);
	retval = target_run_algorithm(target,
				0, NULL,
				ARRAY_SIZE(reg_params), reg_params,
				stm32h5x_bank->rss_lib_addr,
				return_addr, 10000, &armv7m_info);
	breakpoint_remove(target, return_addr);
	if (retval != ERROR_OK) {
		LOG_ERROR("Error running RSS_Lib_Provisioning function");
		free(data);
		free(crc_buffer);
		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		return retval;
	}
	uint32_t returned_res = buf_get_u32(reg_params[0].value, 0, 32);
	LOG_DEBUG("RSSLIB_DataProvisioning returned 0x%" PRIx32 "", returned_res);

