openocd-org/openocd/src/flash/nor/stm32h5x.c
	if (returned_res == 0xEAEAEAEA)
		LOG_INFO("RSSLIB_DataProvisioning executed successfully");
	else if (returned_res == 0xF5F5E0E0)
		LOG_ERROR(" Error: provided RAM addr is not in SRAM3, "
				"obk addr is not aligned on 16 bytes, "
				"privisioned data does not fit within an OBKey section");
	else
		LOG_ERROR("Error executing RSS_Lib_Provisioning function");

	/* free allocation */
	free(crc_buffer);
	free(data);
	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);

	return ERROR_OK;
}

COMMAND_HANDLER(stm32h5x_write_obk_options)
{
	if (CMD_ARGC < 2) {
		command_print(CMD, "stm32hx obk_options <Available_Ram_addr> <RSS_Lib_Provisioning addr>");
		return ERROR_COMMAND_SYNTAX_ERROR;
	}
	struct flash_bank *bank;
	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (retval != ERROR_OK)
		return retval;
	struct stm32h5x_flash_bank *stm32h5x_bank = bank->driver_priv;

	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[1], stm32h5x_bank->available_rm_addr);
	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[2], stm32h5x_bank->rss_lib_addr);

	return ERROR_OK;
}

static const struct command_registration stm32h5x_exec_command_handlers[] = {
	{
		.name = "mass_erase",
		.handler = stm32h5x_handle_mass_erase_command,
		.mode = COMMAND_EXEC,
		.usage = "bank_id",
		.help = "Erase entire flash device.",
	},
	{
		.name = "option_read",
		.handler = stm32h5x_handle_option_read_command,
		.mode = COMMAND_EXEC,
		.usage = "bank_id reg_offset",
		.help = "Read & Display device option bytes.",
	},
	{
		.name = "option_write",
		.handler = stm32h5x_handle_option_write_command,
		.mode = COMMAND_EXEC,
		.usage = "bank_id reg_offset value mask",
		.help = "Write device option bit fields with provided value.",
	},
	{
		.name = "trustzone",
		.handler = stm32h5x_handle_trustzone_command,
		.mode = COMMAND_EXEC,
		.usage = "<bank_id> [enable|disable]",
		.help = "Configure TrustZone security",
	},
	{
		.name = "option_load",
		.handler = stm32h5x_handle_option_load_command,
		.mode = COMMAND_EXEC,
		.usage = "bank_id",
		.help = "Force re-load of device options (will cause device reset).",
	},
	{
		.name = "write_obk",
		.handler = stm32h5x_write_obk,
		.mode = COMMAND_EXEC,
		.usage = "bank_id <path/to/cert>",
		.help = "program data in OBKey-area",
	},
	{
		.name = "write_obk_options",
		.handler = stm32h5x_write_obk_options,
		.mode = COMMAND_EXEC,
		.usage = "bank_id Available_RAM_addr RSSLIB_DataProvisioning address",
		.help = "provide Available RAM address and RSSLIB_DataProvisioning address"
				" before write on obk area",
	},
	COMMAND_REGISTRATION_DONE
};

static const struct command_registration stm32h5x_command_handlers[] = {
	{
		.name = "stm32h5x",
		.mode = COMMAND_ANY,
		.help = "stm32h5x flash command group",
		.usage = "",
		.chain = stm32h5x_exec_command_handlers,
	},
	COMMAND_REGISTRATION_DONE
};

const struct flash_driver stm32h5x_flash = {
	.name = "stm32h5x",
	.commands = stm32h5x_command_handlers,
	.flash_bank_command = stm32h5x_flash_bank_command,
	.erase = stm32h5x_erase,
	.protect = stm32h5x_protect,
	.write = stm32h5x_write,
	.read = stm32h5x_read,
	.probe = stm32h5x_probe,
	.auto_probe = stm32h5x_auto_probe,
	.erase_check = default_flash_blank_check,
	.protect_check = stm32h5x_protect_check,
	.info = get_stm32h5x_info,
	.free_driver_priv = default_flash_free_driver_priv,
};
